<a href="https://colab.research.google.com/github/Rot72/Titanic-kaggle/blob/main/titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
path_train = '/content/drive/MyDrive/Colab Notebooks/titanic_train.csv'
df = pd.read_csv(path_train)

In [59]:
path_test = '/content/drive/MyDrive/Colab Notebooks/titanic_test.csv'
df_test = pd.read_csv(path_test)

In [ ]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [60]:
df_test

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [62]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [63]:
df = df.drop(['Name', 'Ticket', 'Cabin'], axis=1)

In [64]:
df_test = df_test.drop(['Name', 'Ticket', 'Cabin'], axis=1)

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Fare         891 non-null    float64
 8   Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(2)
memory usage: 62.8+ KB

In [66]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Sex          418 non-null    object
 3   Age          332 non-null    float64
 4   SibSp        418 non-null    int64
 5   Parch        418 non-null    int64
 6   Fare         417 non-null    float64
 7   Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 26.2+ KB

In [67]:
num_null_entries = df['Fare'].isnull().sum()
print("Number of null entries in 'Fare':", num_null_entries)

Number of null entries in 'Fare': 0

In [68]:
num_null_entries = df_test['Fare'].isnull().sum()
print("Number of null entries in 'Fare':", num_null_entries)

Number of null entries in 'Fare': 1

In [69]:
mean_fare = df_test['Fare'].mean()
print(mean_fare)
df_test['Fare'] = df_test['Fare'].fillna(mean_fare)

35.627188489208635

In [70]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Sex          418 non-null    object
 3   Age          332 non-null    float64
 4   SibSp        418 non-null    int64
 5   Parch        418 non-null    int64
 6   Fare         418 non-null    float64
 7   Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 26.2+ KB

In [71]:
num_null_entries = df['Embarked'].isnull().sum()
print("Number of null entries in 'Embarked':", num_null_entries)

value_counts = df['Embarked'].value_counts()
print(value_counts)

mode_embarked = df['Embarked'].mode()[0]
print("Mode of Embarked:", mode_embarked)

df.loc[df.Embarked.isnull(), 'Embarked'] = mode_embarked

Number of null entries in 'Embarked': 2
S    644
C    168
Q     77
Name: Embarked, dtype: int64
Mode of Embarked: S

In [72]:
df = pd.get_dummies(df, columns=['Embarked'], prefix='Embarked')

In [73]:
df_test = pd.get_dummies(df_test, columns=['Embarked'], prefix='Embarked')

In [74]:
df = pd.get_dummies(df, columns=['Sex'], prefix='Sex')

In [75]:
df_test = pd.get_dummies(df_test, columns=['Sex'], prefix='Sex')

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Age          714 non-null    float64
 4   SibSp        891 non-null    int64
 5   Parch        891 non-null    int64
 6   Fare         891 non-null    float64
 7   Embarked_C   891 non-null    uint8
 8   Embarked_Q   891 non-null    uint8
 9   Embarked_S   891 non-null    uint8
 10  Sex_female   891 non-null    uint8
 11  Sex_male     891 non-null    uint8
dtypes: float64(2), int64(5), uint8(5)
memory usage: 53.2 KB

In [77]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Age          332 non-null    float64
 3   SibSp        418 non-null    int64
 4   Parch        418 non-null    int64
 5   Fare         418 non-null    float64
 6   Embarked_C   418 non-null    uint8
 7   Embarked_Q   418 non-null    uint8
 8   Embarked_S   418 non-null    uint8
 9   Sex_female   418 non-null    uint8
 10  Sex_male     418 non-null    uint8
dtypes: float64(2), int64(4), uint8(5)
memory usage: 21.8 KB

In [78]:
# Create age groups column
df['Age_Group'] = pd.cut(df['Age'], bins=[0, 17, 64, float('inf')], labels=[1, 2, 3])

# Aplicar one-hot encoding na coluna "Age_Group"
df = pd.get_dummies(df, columns=['Age_Group'])

In [79]:
# Create age groups column
df_test['Age_Group'] = pd.cut(df_test['Age'], bins=[0, 17, 64, float('inf')], labels=[1, 2, 3])

# Aplicar one-hot encoding na coluna "Age_Group"
df_test = pd.get_dummies(df_test, columns=['Age_Group'])

In [80]:
# Apply one-hot encoding on column "Age_Group"
df = df.sort_values('Pclass', ascending=True)

df

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S,Sex_female,Sex_male,Age_Group_1,Age_Group_2,Age_Group_3
445,446,1,1,4.0,0,2,81.8583,0,0,1,0,1,1,0,0
310,311,1,1,24.0,0,0,83.1583,1,0,0,1,0,0,1,0
309,310,1,1,30.0,0,0,56.9292,1,0,0,1,0,0,1,0
307,308,1,1,17.0,1,0,108.9000,1,0,0,1,0,1,0,0
306,307,1,1,NaN,0,0,110.8833,1,0,0,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
379,380,0,3,19.0,0,0,7.7750,0,0,1,0,1,0,1,0
381,382,1,3,1.0,0,2,15.7417,1,0,0,1,0,1,0,0
382,383,0,3,32.0,0,0,7.9250,0,0,1,0,1,0,1,0
371,372,0,3,18.0,1,0,6.4958,0,0,1,0,1,0,1,0
890,891,0,3,32.0,0,0,7.7500,0,1,0,0,1,0,1,0

In [81]:
# Apply one-hot encoding on column "Age_Group"
df_test = df_test.sort_values('Pclass', ascending=True)

df_test

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S,Sex_female,Sex_male,Age_Group_1,Age_Group_2,Age_Group_3
208,1100,1,33.0,0,0,27.7208,1,0,0,1,0,0,1,0
350,1242,1,45.0,0,1,63.3583,1,0,0,1,0,0,1,0
122,1014,1,35.0,1,0,57.7500,1,0,0,1,0,0,1,0
343,1235,1,58.0,0,1,512.3292,1,0,0,1,0,0,1,0
131,1023,1,53.0,0,0,28.5000,1,0,0,0,1,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
165,1057,3,26.0,1,1,22.0250,0,0,1,1,0,0,1,0
163,1055,3,NaN,0,0,7.0000,0,0,1,0,1,0,0,0
161,1053,3,7.0,1,1,15.2458,1,0,0,0,1,1,0,0
199,1091,3,NaN,0,0,8.1125,0,0,1,1,0,0,0,0
417,1309,3,NaN,1,1,22.3583,1,0,0,0,1,0,0,0

In [82]:
num_null_age = df['Age'].isnull().sum()
print("df -> Number of people who are aged equal to null':", num_null_age)

df -> Number of people who are aged equal to null': 177

In [83]:
num_null_age = df_test['Age'].isnull().sum()
print("df_test -> Number of people who are aged equal to null':", num_null_age)

df_test -> Number of people who are aged equal to null': 86

## df -> Number of men who are aged equal to null

In [84]:
condition = (df['Sex_male'] == 1)
num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of men who are aged equal to null:", num_nan_age)
print("")

condition = (df['Pclass'] == 1) & (df['Survived'] == 1) & (df['Sex_male'] == 1)
num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of survivor men 1 class who are aged equal to null:", num_nan_age)

condition = (df['Pclass'] == 2) & (df['Survived'] == 1) & (df['Sex_male'] == 1)
num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of survivor men 2 class who are aged equal to null:", num_nan_age)

condition = (df['Pclass'] == 3) & (df['Survived'] == 1) & (df['Sex_male'] == 1)
num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of survivor men 3 class who are aged equal to null:", num_nan_age)

condition = (df['Survived'] == 1) & (df['Sex_male'] == 1)
num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of survivor men who are aged equal to null:", num_nan_age)

print("")

condition = (df['Pclass'] == 1) & (df['Survived'] == 0) & (df['Sex_male'] == 1)
num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of non survivor men 1 class who are aged equal to null:", num_nan_age)

condition = (df['Pclass'] == 2) & (df['Survived'] == 0) & (df['Sex_male'] == 1)
num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of non survivor men 2 class who are aged equal to null:", num_nan_age)

condition = (df['Pclass'] == 3) & (df['Survived'] == 0) & (df['Sex_male'] == 1)
num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of non survivor men 3 class who are aged equal to null:", num_nan_age)

condition = (df['Survived'] == 0) & (df['Sex_male'] == 1)
num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of non-survivor men who are aged equal to null:", num_nan_age)

Number of men who are aged equal to null: 124

Number of survivor men 1 class who are aged equal to null: 5
Number of survivor men 2 class who are aged equal to null: 2
Number of survivor men 3 class who are aged equal to null: 9
Number of survivor men who are aged equal to null: 16

Number of non survivor men 1 class who are aged equal to null: 16
Number of non survivor men 2 class who are aged equal to null: 7
Number of non survivor men 3 class who are aged equal to null: 85
Number of non-survivor men who are aged equal to null: 108

## df -> Number of women who are aged equal to null

In [85]:
condition = (df['Sex_female'] == 1)
num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of women who are aged equal to null:", num_nan_age)
print("")

condition = (df['Pclass'] == 1) & (df['Survived'] == 1) & (df['Sex_female'] == 1)
num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of survivor women 1 class who are aged equal to null:", num_nan_age)

condition = (df['Pclass'] == 2) & (df['Survived'] == 1) & (df['Sex_female'] == 1)
num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of survivor women 2 class who are aged equal to null:", num_nan_age)

condition = (df['Pclass'] == 3) & (df['Survived'] == 1) & (df['Sex_female'] == 1)
num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of survivor women 3 class who are aged equal to null:", num_nan_age)

condition = (df['Survived'] == 1) & (df['Sex_female'] == 1)
num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of survivor women who are aged equal to null:", num_nan_age)

print("")

condition = (df['Pclass'] == 1) & (df['Survived'] == 0) & (df['Sex_female'] == 1)
num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of non survivor women 1 class who are aged equal to null:", num_nan_age)

condition = (df['Pclass'] == 2) & (df['Survived'] == 0) & (df['Sex_female'] == 1)
num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of non survivor women 2 class who are aged equal to null:", num_nan_age)

condition = (df['Pclass'] == 3) & (df['Survived'] == 0) & (df['Sex_female'] == 1)
num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of non survivor women 3 class who are aged equal to null:", num_nan_age)

condition = (df['Survived'] == 0) & (df['Sex_female'] == 1)
num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of non-survivor women who are aged equal to null:", num_nan_age)

Number of women who are aged equal to null: 53

Number of survivor women 1 class who are aged equal to null: 9
Number of survivor women 2 class who are aged equal to null: 2
Number of survivor women 3 class who are aged equal to null: 25
Number of survivor women who are aged equal to null: 36

Number of non survivor women 1 class who are aged equal to null: 0
Number of non survivor women 2 class who are aged equal to null: 0
Number of non survivor women 3 class who are aged equal to null: 17
Number of non-survivor women who are aged equal to null: 17

## df -> Survived=1, Pclass=1, Sex_male=1

In [86]:
condition = (df['Survived'] == 1) & (df['Pclass'] == 1) & (df['Sex_male'] == 1)

num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of people who are aged equal to null:", num_nan_age)

# Calculate the mean age before outlier removal
mean_age = df.loc[condition, 'Age'].mean()
print('Average age before outlier removal: ', mean_age)

# Calculate the mean age after outlier removal
mean_age = df.loc[condition & (df['Age'] < 65), 'Age'].mean()
print('Average age after outlier removal: ', mean_age)

# Fill in the null values of the "Age" column with the mean
df.loc[condition, 'Age'] = df.loc[condition, 'Age'].fillna(mean_age)

# Calculate the mean age
mean_age = df.loc[condition, 'Age'].mean()
print('Final average age: ', mean_age)

#show df by age
#df_filtered = df.loc[(df['Survived'] == 1) & (df['Pclass'] == 1) & (df['Sex_male'] == 1)]
#df_filtered_sorted = df_filtered.sort_values(by='Age')
#print(df_filtered_sorted)

Number of people who are aged equal to null: 5
Average age before outlier removal:  36.248000000000005
Average age after outlier removal:  35.12615384615385
Final average age:  36.123350427350424

## df -> Survived=0, Pclass=1, Sex_male=1

In [87]:
condition = (df['Survived'] == 0) & (df['Pclass'] == 1) & (df['Sex_male'] == 1)

num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of people for the specified conditions:", num_nan_age)

# Filter the DataFrame with conditions and age not null
filtered_df = df[condition & df['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df['Age'].mean()

# Fill in the null values of the "Age" column with the mean
df.loc[condition, 'Age'] = df.loc[condition, 'Age'].fillna(mean_age)

# Calculate the mean age
mean_age = filtered_df['Age'].mean()
print('Average age: ', mean_age)

Number of people for the specified conditions: 16
Average age:  44.58196721311475

## df -> Survived=1, Pclass=2, Sex_male=1

In [88]:
condition = (df['Survived'] == 1) & (df['Pclass'] == 2) & (df['Sex_male'] == 1)

num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of people who are aged equal to null:", num_nan_age)

# Filter the DataFrame with conditions and age not null
filtered_df = df[condition & df['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df['Age'].mean()

# Fill in the null values of the "Age" column with the mean
df.loc[condition, 'Age'] = df.loc[condition, 'Age'].fillna(mean_age)

# Calculate the mean age
mean_age = filtered_df['Age'].mean()
print('Average age: ', mean_age)

Number of people who are aged equal to null: 2
Average age:  16.022

## df -> Survived=0, Pclass=2, Sex_male=1

In [89]:
condition = (df['Survived'] == 0) & (df['Pclass'] == 2) & (df['Sex_male'] == 1)

num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of people who are aged equal to null:", num_nan_age)

# Filter the DataFrame with conditions and age not null
filtered_df = df[condition & df['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df['Age'].mean()

# Fill in the null values of the "Age" column with the mean
df.loc[condition, 'Age'] = df.loc[condition, 'Age'].fillna(mean_age)

# Calculate the mean age
mean_age = filtered_df['Age'].mean()
print('Average age: ', mean_age)

Number of people who are aged equal to null: 7
Average age:  33.36904761904762

## df -> Survived=1, Pclass=3, Sex_male=1

In [90]:
condition = (df['Survived'] == 1) & (df['Pclass'] == 3) & (df['Sex_male'] == 1)

num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of people who are aged equal to null:", num_nan_age)

# Filter the DataFrame with conditions and age not null
filtered_df = df[condition & df['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df['Age'].mean()

# Fill in the null values of the "Age" column with the mean
df.loc[condition, 'Age'] = df.loc[condition, 'Age'].fillna(mean_age)

# Calculate the mean age
mean_age = filtered_df['Age'].mean()
print('Average age: ', mean_age)

Number of people who are aged equal to null: 9
Average age:  22.27421052631579

##  df -> Survived=0, Pclass=3, Sex_male=1

In [91]:
condition = (df['Survived'] == 0) & (df['Pclass'] == 3) & (df['Sex_male'] == 1)

num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of people who are aged equal to null:", num_nan_age)

# Filter the DataFrame with conditions and age not null
filtered_df = df[condition & df['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df['Age'].mean()

# Fill in the null values of the "Age" column with the mean
df.loc[condition, 'Age'] = df.loc[condition, 'Age'].fillna(mean_age)

# Calculate the mean age
mean_age = filtered_df['Age'].mean()
print('Average age: ', mean_age)

Number of people who are aged equal to null: 85
Average age:  27.25581395348837

## df ->  Survived=1, Sex_male=1

In [92]:
condition = (df['Age_Group_1'] == 1) & (df['Survived'] == 1) & (df['Sex_male'] == 1)

# Filter the DataFrame with conditions and age not null
filtered_df = df[condition & df['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df['Age'].mean()
print('Average age: ', mean_age)

Average age:  5.072608695652174

In [93]:
condition = (df['Survived'] == 1) & (df['Sex_male'] == 1)

# Filter the DataFrame with conditions and age not null
filtered_df = df[condition & df['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df['Age'].mean()
print('Average age: ', mean_age)

Average age:  27.016629944656987

## ============================================

## df ->  Survived=1, Pclass=1, Sex_female=1

In [94]:
condition = (df['Survived'] == 1) & (df['Pclass'] == 1) & (df['Sex_female'] == 1)

num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of people for the specified conditions:", num_nan_age)

# Filter the DataFrame with conditions and age not null
filtered_df = df[condition & df['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df['Age'].mean()

# Fill in the null values of the "Age" column with the mean
df.loc[condition, 'Age'] = df.loc[condition, 'Age'].fillna(mean_age)

# Calculate the mean age
mean_age = filtered_df['Age'].mean()
print('Average age: ', mean_age)

Number of people for the specified conditions: 9
Average age:  34.9390243902439

##  df -> Survived=0, Pclass=1, Sex_female=1

In [95]:
condition = (df['Survived'] == 0) & (df['Pclass'] == 1) & (df['Sex_female'] == 1)

num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of people for the specified conditions:", num_nan_age)

# Filter the DataFrame with conditions and age not null
filtered_df = df[condition & df['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df['Age'].mean()

# Fill in the null values of the "Age" column with the mean
df.loc[condition, 'Age'] = df.loc[condition, 'Age'].fillna(mean_age)

# Calculate the mean age
mean_age = filtered_df['Age'].mean()
print('Average age: ', mean_age)

Number of people for the specified conditions: 0
Average age:  25.666666666666668

## df ->  Survived=1, Pclass=2, Sex_female=1

In [96]:
condition = (df['Survived'] == 1) & (df['Pclass'] == 2) & (df['Sex_female'] == 1)

num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of people for the specified conditions:", num_nan_age)

# Filter the DataFrame with conditions and age not null
filtered_df = df[condition & df['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df['Age'].mean()

# Fill in the null values of the "Age" column with the mean
df.loc[condition, 'Age'] = df.loc[condition, 'Age'].fillna(mean_age)

# Calculate the mean age
mean_age = filtered_df['Age'].mean()
print('Average age: ', mean_age)

Number of people for the specified conditions: 2
Average age:  28.080882352941178

##  df -> Survived=0, Pclass=2, Sex_female=1

In [97]:
condition = (df['Survived'] == 0) & (df['Pclass'] == 2) & (df['Sex_female'] == 1)

num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of people for the specified conditions:", num_nan_age)

# Filter the DataFrame with conditions and age not null
filtered_df = df[condition & df['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df['Age'].mean()

# Fill in the null values of the "Age" column with the mean
df.loc[condition, 'Age'] = df.loc[condition, 'Age'].fillna(mean_age)

# Calculate the mean age
mean_age = filtered_df['Age'].mean()
print('Average age: ', mean_age)

Number of people for the specified conditions: 0
Average age:  36.0

## df ->  Survived=1, Pclass=3, Sex_female=1

In [98]:
condition = (df['Survived'] == 1) & (df['Pclass'] == 3) & (df['Sex_female'] == 1)

num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of people for the specified conditions:", num_nan_age)

# Filter the DataFrame with conditions and age not null
filtered_df = df[condition & df['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df['Age'].mean()

# Fill in the null values of the "Age" column with the mean
df.loc[condition, 'Age'] = df.loc[condition, 'Age'].fillna(mean_age)

# Calculate the mean age
mean_age = filtered_df['Age'].mean()
print('Average age: ', mean_age)

Number of people for the specified conditions: 25
Average age:  19.329787234042552

## df ->  Survived=0, Pclass=3, Sex_female=1

In [99]:
condition = (df['Survived'] == 0) & (df['Pclass'] == 3) & (df['Sex_female'] == 1)

num_nan_age = df[condition]['Age'].isnull().sum()
print("Number of people for the specified conditions:", num_nan_age)

# Filter the DataFrame with conditions and age not null
filtered_df = df[condition & df['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df['Age'].mean()

# Fill in the null values of the "Age" column with the mean
df.loc[condition, 'Age'] = df.loc[condition, 'Age'].fillna(mean_age)

# Calculate the mean age
mean_age = filtered_df['Age'].mean()
print('Average age: ', mean_age)

Number of people for the specified conditions: 17
Average age:  23.818181818181817

In [100]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 445 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Age          891 non-null    float64
 4   SibSp        891 non-null    int64
 5   Parch        891 non-null    int64
 6   Fare         891 non-null    float64
 7   Embarked_C   891 non-null    uint8
 8   Embarked_Q   891 non-null    uint8
 9   Embarked_S   891 non-null    uint8
 10  Sex_female   891 non-null    uint8
 11  Sex_male     891 non-null    uint8
 12  Age_Group_1  891 non-null    uint8
 13  Age_Group_2  891 non-null    uint8
 14  Age_Group_3  891 non-null    uint8
dtypes: float64(2), int64(5), uint8(8)
memory usage: 62.6 KB

## df_test -> Number of men who are aged equal to null

In [101]:
condition = (df_test['Sex_male'] == 1)
num_nan_age = df_test[condition]['Age'].isnull().sum()
print("Number of men who are aged equal to null:", num_nan_age)
print("")

condition = (df_test['Pclass'] == 1) & (df_test['Sex_male'] == 1)
num_nan_age = df_test[condition]['Age'].isnull().sum()
print("Number of men 1 class who are aged equal to null:", num_nan_age)

condition = (df_test['Pclass'] == 2) & (df_test['Sex_male'] == 1)
num_nan_age = df_test[condition]['Age'].isnull().sum()
print("Number of men 2 class who are aged equal to null:", num_nan_age)

condition = (df_test['Pclass'] == 3) & (df_test['Sex_male'] == 1)
num_nan_age = df_test[condition]['Age'].isnull().sum()
print("Number of men 3 class who are aged equal to null:", num_nan_age)

Number of men who are aged equal to null: 61

Number of men 1 class who are aged equal to null: 7
Number of men 2 class who are aged equal to null: 4
Number of men 3 class who are aged equal to null: 50

## df_test -> Number of women who are aged equal to null

In [102]:
condition = (df_test['Sex_female'] == 1)
num_nan_age = df_test[condition]['Age'].isnull().sum()
print("Number of women who are aged equal to null:", num_nan_age)
print("")

condition = (df_test['Pclass'] == 1) & (df_test['Sex_female'] == 1)
num_nan_age = df_test[condition]['Age'].isnull().sum()
print("Number of survivor women 1 class who are aged equal to null:", num_nan_age)

condition = (df_test['Pclass'] == 2) & (df_test['Sex_female'] == 1)
num_nan_age = df_test[condition]['Age'].isnull().sum()
print("Number of survivor women 2 class who are aged equal to null:", num_nan_age)

condition = (df_test['Pclass'] == 3) & (df_test['Sex_female'] == 1)
num_nan_age = df_test[condition]['Age'].isnull().sum()
print("Number of survivor women 3 class who are aged equal to null:", num_nan_age)

Number of women who are aged equal to null: 25

Number of survivor women 1 class who are aged equal to null: 2
Number of survivor women 2 class who are aged equal to null: 1
Number of survivor women 3 class who are aged equal to null: 22

In [103]:
display(df_test)

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S,Sex_female,Sex_male,Age_Group_1,Age_Group_2,Age_Group_3
208,1100,1,33.0,0,0,27.7208,1,0,0,1,0,0,1,0
350,1242,1,45.0,0,1,63.3583,1,0,0,1,0,0,1,0
122,1014,1,35.0,1,0,57.7500,1,0,0,1,0,0,1,0
343,1235,1,58.0,0,1,512.3292,1,0,0,1,0,0,1,0
131,1023,1,53.0,0,0,28.5000,1,0,0,0,1,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
165,1057,3,26.0,1,1,22.0250,0,0,1,1,0,0,1,0
163,1055,3,NaN,0,0,7.0000,0,0,1,0,1,0,0,0
161,1053,3,7.0,1,1,15.2458,1,0,0,0,1,1,0,0
199,1091,3,NaN,0,0,8.1125,0,0,1,1,0,0,0,0
417,1309,3,NaN,1,1,22.3583,1,0,0,0,1,0,0,0

## df_test -> Pclass=1, Sex_male=1, Age_Group_1=1

In [104]:
filtered_data = df_test[(df_test['Pclass'] == 1) & (df_test['Sex_male'] == 1)]
selected_columns = ['Pclass', 'Sex_male', 'Age_Group_1', 'Age_Group_2', 'Age_Group_3', 'Age']
filtered_data = filtered_data[selected_columns].sort_values(by='Age')
print(filtered_data)

     Pclass  Sex_male  Age_Group_1  Age_Group_2  Age_Group_3   Age
196       1         1            1            0            0   6.0
64        1         1            1            0            0  13.0
403       1         1            1            0            0  17.0
23        1         1            0            1            0  21.0
390       1         1            0            1            0  23.0
287       1         1            0            1            0  24.0
50        1         1            0            1            0  24.0
94        1         1            0            1            0  25.0
252       1         1            0            1            0  27.0
73        1         1            0            1            0  28.5
34        1         1            0            1            0  30.0
306       1         1            0            1            0  30.0
298       1         1            0            1            0  30.0
335       1         1            0            1            0  30.0
68        1         1            0            1            0  31.0
75        1         1            0            1            0  32.5
323       1         1            0            1            0  33.0
118       1         1            0            1            0  36.0
181       1         1            0            1            0  37.0
331       1         1            0            1            0  39.0
234       1         1            0            1            0  39.0
28        1         1            0            1            0  41.0
245       1         1            0            1            0  41.0
215       1         1            0            1            0  42.0
158       1         1            0            1            0  42.0
144       1         1            0            1            0  42.0
404       1         1            0            1            0  43.0
242       1         1            0            1            0  45.0
46        1         1            0            1            0  45.0
327       1         1            0            1            0  46.0
270       1         1            0            1            0  46.0
11        1         1            0            1            0  46.0
67        1         1            0            1            0  47.0
202       1         1            0            1            0  47.0
166       1         1            0            1            0  48.0
82        1         1            0            1            0  49.0
372       1         1            0            1            0  49.0
407       1         1            0            1            0  50.0
355       1         1            0            1            0  50.0
131       1         1            0            1            0  53.0
293       1         1            0            1            0  53.0
177       1         1            0            1            0  54.0
308       1         1            0            1            0  55.0
378       1         1            0            1            0  55.0
20        1         1            0            1            0  55.0
217       1         1            0            1            0  57.0
316       1         1            0            1            0  57.0
142       1         1            0            1            0  61.0
236       1         1            0            1            0  64.0
81        1         1            0            0            1  67.0
146       1         1            0            0            0   NaN
148       1         1            0            0            0   NaN
290       1         1            0            0            0   NaN
266       1         1            0            0            0   NaN
191       1         1            0            0            0   NaN
205       1         1            0            0            0   NaN
41        1         1            0            0            0   NaN

## Pclass=1, Sex_male=1

In [105]:
# df_test -> Pclass=1, Sex_male=1
count = df_test[(df_test['Pclass'] == 1) & (df_test['Sex_male'] == 1) & (df_test['Age'].isnull())].shape[0]
print("Number of Pclass=1 men without registered age:", count)

Number of Pclass=1 men without registered age: 7

In [106]:
# df_test -> Pclass=1, Sex_male=1, Age_Group_1=1
condition = (df_test['Pclass'] == 1) & (df_test['Sex_male'] == 1) & (df_test['Age_Group_1'] == 1)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=1, Sex_male=1, Age_Group_1=1: ', mean_age)

Number of people for the specified conditions: 3
Average age Pclass=1, Sex_male=1, Age_Group_1=1:  12.0

In [107]:
# df_test -> Pclass=1, Sex_male=1, Age_Group_2=1
condition = (df_test['Pclass'] == 1) & (df_test['Sex_male'] == 1) & (df_test['Age_Group_2'] == 1)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=1, Sex_male=1, Age_Group_2=1: ', mean_age)

Number of people for the specified conditions: 46
Average age Pclass=1, Sex_male=1, Age_Group_2=1:  41.80434782608695

In [108]:
# df_test -> Pclass=1, Sex_male=1, Age_Group_3=1
condition = (df_test['Pclass'] == 1) & (df_test['Sex_male'] == 1) & (df_test['Age_Group_1'] == 3)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=1, Sex_male=1, Age_Group_3=1: ', mean_age)

Number of people for the specified conditions: 0
Average age Pclass=1, Sex_male=1, Age_Group_3=1:  nan

In [109]:
# df_test -> Pclass=1, Sex_male=1
condition = (df_test['Pclass'] == 1) & (df_test['Sex_male'] == 1)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=1, Sex_male=1: ', mean_age)

Number of people for the specified conditions: 50
Average age Pclass=1, Sex_male=1:  40.52

In [110]:
# df_test -> Pclass=1, Sex_male=1, no Age information
condition = (df_test['Pclass'] == 1) & (df_test['Sex_male'] == 1)
num_nan_age = df_test[condition]['Age'].isnull().sum()
print("Number of people for the specified conditions:", num_nan_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age_to_fill = filtered_df_test['Age'].mean()
print('Average age to fill in the empty age fields: ', mean_age_to_fill)

#Fill in the null values of the "Age" column with the mean
df_test.loc[condition, 'Age'] = df_test.loc[condition, 'Age'].fillna(mean_age_to_fill)

Number of people for the specified conditions: 7
Average age to fill in the empty age fields:  40.52

In [111]:
# df_test -> Pclass=1, Sex_male=1, new average age
condition = (df_test['Pclass'] == 1) & (df_test['Sex_male'] == 1)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age']]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('New Average age: ', mean_age)

New Average age:  40.519999999999996

## Pclass=2, Sex_male=1

In [112]:
# df_test -> Pclass=2, Sex_male=1
count = df_test[(df_test['Pclass'] == 2) & (df_test['Sex_male'] == 1) & (df_test['Age'].isnull())].shape[0]
print("Number of Pclass=2 men without registered age:", count)

Number of Pclass=2 men without registered age: 4

In [113]:
# df_test -> Pclass=2, Sex_male=1, Age_Group_1=1
condition = (df_test['Pclass'] == 2) & (df_test['Sex_male'] == 1) & (df_test['Age_Group_1'] == 1)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=2, Sex_male=1, Age_Group_1=1: ', mean_age)

Number of people for the specified conditions: 4
Average age Pclass=2, Sex_male=1, Age_Group_1=1:  10.25

In [114]:
# df_test -> Pclass=2, Sex_male=1, Age_Group_2=1
condition = (df_test['Pclass'] == 2) & (df_test['Sex_male'] == 1) & (df_test['Age_Group_2'] == 1)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=2, Sex_male=1, Age_Group_2=1: ', mean_age)

Number of people for the specified conditions: 55
Average age Pclass=2, Sex_male=1, Age_Group_2=1:  32.445454545454545

In [115]:
# df_test -> Pclass=2, Sex_male=1, Age_Group_3=1
condition = (df_test['Pclass'] == 2) & (df_test['Sex_male'] == 1) & (df_test['Age_Group_1'] == 3)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=2, Sex_male=1, Age_Group_3=1: ', mean_age)

Number of people for the specified conditions: 0
Average age Pclass=2, Sex_male=1, Age_Group_3=1:  nan

In [116]:
# df_test -> Pclass=2, Sex_male=1
condition = (df_test['Pclass'] == 2) & (df_test['Sex_male'] == 1)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=2, Sex_male=1: ', mean_age)

Number of people for the specified conditions: 59
Average age Pclass=2, Sex_male=1:  30.940677966101696

In [117]:
# df_test -> Pclass=2, Sex_male=1, no Age information
condition = (df_test['Pclass'] == 2) & (df_test['Sex_male'] == 1)
num_nan_age = df_test[condition]['Age'].isnull().sum()
print("Number of people for the specified conditions:", num_nan_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age_to_fill = filtered_df_test['Age'].mean()
print('Average age to fill in the empty age fields: ', mean_age_to_fill)

#Fill in the null values of the "Age" column with the mean
df_test.loc[condition, 'Age'] = df_test.loc[condition, 'Age'].fillna(mean_age_to_fill)

Number of people for the specified conditions: 4
Average age to fill in the empty age fields:  30.940677966101696

In [118]:
# df_test -> Pclass=2, Sex_male=1, new average age
condition = (df_test['Pclass'] == 2) & (df_test['Sex_male'] == 1)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age']]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('New Average age: ', mean_age)

New Average age:  30.940677966101696

In [119]:
# df_test -> Pclass=2, Sex_male=1
condition = (df_test['Pclass'] == 2) & (df_test['Sex_male'] == 1)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('New average age Pclass=2, Sex_male=1: ', mean_age)

Number of people for the specified conditions: 63
New average age Pclass=2, Sex_male=1:  30.940677966101696

## Pclass=3, Sex_male=1

In [120]:
# df_test -> Pclass=3, Sex_male=1
count = df_test[(df_test['Pclass'] == 3) & (df_test['Sex_male'] == 1) & (df_test['Age'].isnull())].shape[0]
print("Number of Pclass=3 class men without registered age:", count)

Number of Pclass=3 class men without registered age: 50

In [121]:
# df_test -> Pclass=3, Sex_male=1, Age_Group_1=1
condition = (df_test['Pclass'] == 3) & (df_test['Sex_male'] == 1) & (df_test['Age_Group_1'] == 1)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=3, Sex_male=1, Age_Group_1=1: ', mean_age)

Number of people for the specified conditions: 17
Average age Pclass=3, Sex_male=1, Age_Group_1=1:  9.524117647058823

In [122]:
# df_test -> Pclass=3, Sex_male=1, Age_Group_2=1
condition = (df_test['Pclass'] == 3) & (df_test['Sex_male'] == 1) & (df_test['Age_Group_2'] == 1)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=3, Sex_male=1, Age_Group_2=1: ', mean_age)

Number of people for the specified conditions: 79
Average age Pclass=3, Sex_male=1, Age_Group_2=1:  27.753164556962027

In [123]:
# df_test -> Pclass=3, Sex_male=1, Age_Group_3=1
condition = (df_test['Pclass'] == 3) & (df_test['Sex_male'] == 1) & (df_test['Age_Group_1'] == 3)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=3, Sex_male=1, Age_Group_3=1: ', mean_age)

Number of people for the specified conditions: 0
Average age Pclass=3, Sex_male=1, Age_Group_3=1:  nan

In [124]:
# df_test -> Pclass=3, Sex_male=1
condition = (df_test['Pclass'] == 3) & (df_test['Sex_male'] == 1)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=3, Sex_male=1: ', mean_age)

Number of people for the specified conditions: 96
Average age Pclass=3, Sex_male=1:  24.525104166666665

In [125]:
# df_test -> Pclass=3, Sex_male=1, no Age information
condition = (df_test['Pclass'] == 3) & (df_test['Sex_male'] == 1)
num_nan_age = df_test[condition]['Age'].isnull().sum()
print("Number of people no age information:", num_nan_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age_to_fill = filtered_df_test['Age'].mean()
print('Average age to fill in the empty age fields: ', mean_age_to_fill)

#Fill in the null values of the "Age" column with the mean
df_test.loc[condition, 'Age'] = df_test.loc[condition, 'Age'].fillna(mean_age_to_fill)

Number of people no age information: 50
Average age to fill in the empty age fields:  24.525104166666665

In [126]:
# df_test -> Pclass=3, Sex_male=1, new average age
condition = (df_test['Pclass'] == 3) & (df_test['Sex_male'] == 1)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age']]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('New Average age: ', mean_age)

New Average age:  24.525104166666665

In [127]:
# df_test -> Pclass=3, Sex_male=1
condition = (df_test['Pclass'] == 3) & (df_test['Sex_male'] == 1)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('New average age Pclass=3, Sex_male=1: ', mean_age)

Number of people for the specified conditions: 146
New average age Pclass=3, Sex_male=1:  24.525104166666665

## Pclass=1, Sex_female=1

In [128]:
# df_test -> Pclass=1, Sex_female=1
count = df_test[(df_test['Pclass'] == 1) & (df_test['Sex_female'] == 1) & (df_test['Age'].isnull())].shape[0]
print("Number of Pclass=1 men without registered age:", count)

# df_test -> Pclass=1, Sex_female=1, Age_Group_1=1
condition = (df_test['Pclass'] == 1) & (df_test['Sex_female'] == 1) & (df_test['Age_Group_1'] == 1)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=1, Sex_female=1, Age_Group_1=1: ', mean_age)

# df_test -> Pclass=1, Sex_female=1, Age_Group_2=1
condition = (df_test['Pclass'] == 1) & (df_test['Sex_female'] == 1) & (df_test['Age_Group_2'] == 1)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=1, Sex_female=1, Age_Group_2=1: ', mean_age)

# df_test -> Pclass=1, Sex_female=1, Age_Group_3=1
condition = (df_test['Pclass'] == 1) & (df_test['Sex_female'] == 1) & (df_test['Age_Group_1'] == 3)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=1, Sex_female=1, Age_Group_3=1: ', mean_age)

# df_test -> Pclass=1, Sex_female=1
condition = (df_test['Pclass'] == 1) & (df_test['Sex_female'] == 1)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=1, Sex_female=1: ', mean_age)

# df_test -> Pclass=1, Sex_female=1, no Age information
condition = (df_test['Pclass'] == 1) & (df_test['Sex_female'] == 1)
num_nan_age = df_test[condition]['Age'].isnull().sum()
print("Number of people for the specified conditions:", num_nan_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age_to_fill = filtered_df_test['Age'].mean()
print('Average age to fill in the empty age fields: ', mean_age_to_fill)

#Fill in the null values of the "Age" column with the mean
df_test.loc[condition, 'Age'] = df_test.loc[condition, 'Age'].fillna(mean_age_to_fill)

# df_test -> Pclass=1, Sex_female=1, new average age
condition = (df_test['Pclass'] == 1) & (df_test['Sex_female'] == 1)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age']]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('New Average age: ', mean_age)

Number of Pclass=1 men without registered age: 2
Number of people for the specified conditions: 0
Average age Pclass=1, Sex_female=1, Age_Group_1=1:  nan
Number of people for the specified conditions: 47
Average age Pclass=1, Sex_female=1, Age_Group_2=1:  40.59574468085106
Number of people for the specified conditions: 0
Average age Pclass=1, Sex_female=1, Age_Group_3=1:  nan
Number of people for the specified conditions: 48
Average age Pclass=1, Sex_female=1:  41.333333333333336
Number of people for the specified conditions: 2
Average age to fill in the empty age fields:  41.333333333333336
New Average age:  41.33333333333334

## Pclass=2, Sex_female=1

In [129]:
# df_test -> Pclass=2, Sex_female=1
count = df_test[(df_test['Pclass'] == 2) & (df_test['Sex_female'] == 1) & (df_test['Age'].isnull())].shape[0]
print("Number of Pclass=2 men without registered age:", count)

# df_test -> Pclass=2, Sex_female=1, Age_Group_1=1
condition = (df_test['Pclass'] == 2) & (df_test['Sex_female'] == 1) & (df_test['Age_Group_1'] == 1)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=2, Sex_female=1, Age_Group_1=1: ', mean_age)

# df_test -> Pclass=2, Sex_female=1, Age_Group_2=1
condition = (df_test['Pclass'] == 2) & (df_test['Sex_female'] == 1) & (df_test['Age_Group_2'] == 1)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=2, Sex_female=1, Age_Group_2=1: ', mean_age)

# df_test -> Pclass=2, Sex_female=1, Age_Group_3=1
condition = (df_test['Pclass'] == 2) & (df_test['Sex_female'] == 1) & (df_test['Age_Group_1'] == 3)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=2, Sex_female=1, Age_Group_3=1: ', mean_age)

# df_test -> Pclass=2, Sex_female=1
condition = (df_test['Pclass'] == 2) & (df_test['Sex_female'] == 1)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=2, Sex_female=1: ', mean_age)

# df_test -> Pclass=2, Sex_female=1, no Age information
condition = (df_test['Pclass'] == 2) & (df_test['Sex_female'] == 1)
num_nan_age = df_test[condition]['Age'].isnull().sum()
print("Number of people for the specified conditions:", num_nan_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age_to_fill = filtered_df_test['Age'].mean()
print('Average age to fill in the empty age fields: ', mean_age_to_fill)

#Fill in the null values of the "Age" column with the mean
df_test.loc[condition, 'Age'] = df_test.loc[condition, 'Age'].fillna(mean_age_to_fill)

# df_test -> Pclass=2, Sex_female=1, new average age
condition = (df_test['Pclass'] == 2) & (df_test['Sex_female'] == 1)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age']]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('New Average age: ', mean_age)

Number of Pclass=2 men without registered age: 1
Number of people for the specified conditions: 6
Average age Pclass=2, Sex_female=1, Age_Group_1=1:  8.153333333333334
Number of people for the specified conditions: 23
Average age Pclass=2, Sex_female=1, Age_Group_2=1:  28.608695652173914
Number of people for the specified conditions: 0
Average age Pclass=2, Sex_female=1, Age_Group_3=1:  nan
Number of people for the specified conditions: 29
Average age Pclass=2, Sex_female=1:  24.376551724137933
Number of people for the specified conditions: 1
Average age to fill in the empty age fields:  24.376551724137933
New Average age:  24.37655172413793

## Pclass=3, Sex_female=1

In [130]:
# df_test -> Pclass=3, Sex_female=1
count = df_test[(df_test['Pclass'] == 3) & (df_test['Sex_female'] == 1) & (df_test['Age'].isnull())].shape[0]
print("Number of Pclass=3 men without registered age:", count)

# df_test -> Pclass=3, Sex_female=1, Age_Group_1=1
condition = (df_test['Pclass'] == 3) & (df_test['Sex_female'] == 1) & (df_test['Age_Group_1'] == 1)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=3, Sex_female=1, Age_Group_1=1: ', mean_age)

# df_test -> Pclass=3, Sex_female=1, Age_Group_2=1
condition = (df_test['Pclass'] == 3) & (df_test['Sex_female'] == 1) & (df_test['Age_Group_2'] == 1)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=3, Sex_female=1, Age_Group_2=1: ', mean_age)

# df_test -> Pclass=3, Sex_female=1, Age_Group_3=1
condition = (df_test['Pclass'] == 3) & (df_test['Sex_female'] == 1) & (df_test['Age_Group_1'] == 3)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=3, Sex_female=1, Age_Group_3=1: ', mean_age)

# df_test -> Pclass=3, Sex_female=1
condition = (df_test['Pclass'] == 3) & (df_test['Sex_female'] == 1)

num_age = df_test[condition]['Age'].notnull().sum()
print("Number of people for the specified conditions:", num_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('Average age Pclass=3, Sex_female=1: ', mean_age)

# df_test -> Pclass=3, Sex_female=1, no Age information
condition = (df_test['Pclass'] == 3) & (df_test['Sex_female'] == 1)
num_nan_age = df_test[condition]['Age'].isnull().sum()
print("Number of people for the specified conditions:", num_nan_age)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age'].notnull()]

# Calculate the mean age
mean_age_to_fill = filtered_df_test['Age'].mean()
print('Average age to fill in the empty age fields: ', mean_age_to_fill)

#Fill in the null values of the "Age" column with the mean
df_test.loc[condition, 'Age'] = df_test.loc[condition, 'Age'].fillna(mean_age_to_fill)

# df_test -> Pclass=3, Sex_female=1, new average age
condition = (df_test['Pclass'] == 3) & (df_test['Sex_female'] == 1)

# Filter the DataFrame with conditions and age not null
filtered_df_test = df_test[condition & df_test['Age']]

# Calculate the mean age
mean_age = filtered_df_test['Age'].mean()
print('New Average age: ', mean_age)

Number of Pclass=3 men without registered age: 22
Number of people for the specified conditions: 11
Average age Pclass=3, Sex_female=1, Age_Group_1=1:  8.379090909090909
Number of people for the specified conditions: 39
Average age Pclass=3, Sex_female=1, Age_Group_2=1:  27.21794871794872
Number of people for the specified conditions: 0
Average age Pclass=3, Sex_female=1, Age_Group_3=1:  nan
Number of people for the specified conditions: 50
Average age Pclass=3, Sex_female=1:  23.073400000000003
Number of people for the specified conditions: 22
Average age to fill in the empty age fields:  23.073400000000003
New Average age:  23.0734

In [131]:
# Check if there are any null fields in the DataFrame
is_null = df_test.isnull().any().any()

if is_null:
    print("There are null fields in the DataFrame.")
else:
    print("There are no null fields in the DataFrame.")

There are no null fields in the DataFrame.

In [132]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 445 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Age          891 non-null    float64
 4   SibSp        891 non-null    int64
 5   Parch        891 non-null    int64
 6   Fare         891 non-null    float64
 7   Embarked_C   891 non-null    uint8
 8   Embarked_Q   891 non-null    uint8
 9   Embarked_S   891 non-null    uint8
 10  Sex_female   891 non-null    uint8
 11  Sex_male     891 non-null    uint8
 12  Age_Group_1  891 non-null    uint8
 13  Age_Group_2  891 non-null    uint8
 14  Age_Group_3  891 non-null    uint8
dtypes: float64(2), int64(5), uint8(8)
memory usage: 62.6 KB

In [135]:
df.to_csv('titanic_train_after_analysis.csv')

In [136]:
df_test.to_csv('titanic_test_after_analysis.csv')

## accuracy_score

In [137]:
from sklearn.metrics import accuracy_score

## train_test_split

In [138]:
from sklearn.model_selection import train_test_split

In [139]:
X = df.drop(['PassengerId', 'Survived'], axis=1)
y = df['Survived']

In [140]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [141]:
# Check if there are any null fields in the DataFrame
is_null = df.isnull().any().any()

if is_null:
    print("There are null fields in the DataFrame.")
else:
    print("There are no null fields in the DataFrame.")

There are no null fields in the DataFrame.

## DecisionTreeClassifier

In [142]:
from sklearn.tree import DecisionTreeClassifier

# Instantiate the Decision Tree classifier
clf_DC = DecisionTreeClassifier(random_state=42)

# Train the model using the training set
clf_DC.fit(X_train, y_train)

# Make predictions on the test set
y_pred_DC = clf_DC.predict(X_test)

# Evaluate the model accuracy
accuracy = accuracy_score(y_test, y_pred_DC)
print("Model accuracy: {:.2f}%".format(accuracy * 100))

Model accuracy: 82.68%

## KNeighborsClassifier

In [143]:
import warnings

# Ignore the specific future warning
warnings.filterwarnings("ignore", category=FutureWarning)

In [144]:
from sklearn.neighbors import KNeighborsClassifier

neigh = KNeighborsClassifier(n_neighbors=3)
clf_neigh = neigh.fit(X, y)

# Make predictions on the test set
y_pred_neigh = clf_neigh.predict(X_test)

# Evaluate the model accuracy
accuracy = accuracy_score(y_test, y_pred_neigh)
print("Model accuracy: {:.2f}%".format(accuracy * 100))

Model accuracy: 86.59%

## LogisticRegression

In [145]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression(max_iter=1000, random_state=42)
model = model.fit(X, y)
y_pred_LR = model.predict(X_test)
accuracy = model.score(X, y)
print("Model accuracy: {:.2f}%".format(accuracy * 100))

Model accuracy: 81.93%

## Confusion Matrix

In [146]:
from sklearn.metrics import confusion_matrix

## Confusion Matrix - DecisionTreeClassifier

In [147]:
y_true = y_test
y_pred_dt = y_pred_DC

cm = confusion_matrix(y_true, y_pred_dt)

print("Confusion Matrix DecisionTreeClassifier:")
print(cm)

Confusion Matrix DecisionTreeClassifier:
[[93  9]
 [22 55]]

## Confusion Matrix - KNeighborsClassifier

In [148]:
y_true = y_test
y_pred_knn = y_pred_neigh

cm = confusion_matrix(y_true, y_pred_knn)

print("Confusion Matrix KNeighborsClassifier:")
print(cm)

Confusion Matrix KNeighborsClassifier:
[[92 10]
 [14 63]]

## Confusion Matrix - LogisticRegression

In [149]:
y_true = y_test
y_pred_lr = y_pred_LR

cm = confusion_matrix(y_true, y_pred_lr)

print("Confusion Matrix LogisticRegression:")
print(cm)

Confusion Matrix LogisticRegression:
[[96  6]
 [20 57]]

In [150]:
from sklearn.metrics import accuracy_score, precision_score, recall_score, f1_score

# Supondo que você já tenha as matrizes de confusão para cada modelo
cm_dt = [[93, 9], [22, 55]]
cm_knn = [[92, 10], [14, 63]]
cm_lr = [[96, 6], [20, 57]]

# Calcula as métricas para cada modelo
accuracy_dt = accuracy_score(y_true, y_pred_dt)
precision_dt = precision_score(y_true, y_pred_dt)
recall_dt = recall_score(y_true, y_pred_dt)
f1_dt = f1_score(y_true, y_pred_dt)

accuracy_knn = accuracy_score(y_true, y_pred_knn)
precision_knn = precision_score(y_true, y_pred_knn)
recall_knn = recall_score(y_true, y_pred_knn)
f1_knn = f1_score(y_true, y_pred_knn)

accuracy_lr = accuracy_score(y_true, y_pred_lr)
precision_lr = precision_score(y_true, y_pred_lr)
recall_lr = recall_score(y_true, y_pred_lr)
f1_lr = f1_score(y_true, y_pred_lr)

# Imprime as métricas para cada modelo
print("DecisionTreeClassifier:")
print("Accuracy:", accuracy_dt)
print("Precision:", precision_dt)
print("Recall:", recall_dt)
print("F1-Score:", f1_dt)
print()

print("KNeighborsClassifier:")
print("Accuracy:", accuracy_knn)
print("Precision:", precision_knn)
print("Recall:", recall_knn)
print("F1-Score:", f1_knn)
print()

print("LogisticRegression:")
print("Accuracy:", accuracy_lr)
print("Precision:", precision_lr)
print("Recall:", recall_lr)
print("F1-Score:", f1_lr)

DecisionTreeClassifier:
Accuracy: 0.8268156424581006
Precision: 0.859375
Recall: 0.7142857142857143
F1-Score: 0.7801418439716311

KNeighborsClassifier:
Accuracy: 0.8659217877094972
Precision: 0.863013698630137
Recall: 0.8181818181818182
F1-Score: 0.8400000000000001

LogisticRegression:
Accuracy: 0.8547486033519553
Precision: 0.9047619047619048
Recall: 0.7402597402597403
F1-Score: 0.8142857142857143

# Prediction for test with KNeighborsClassifier model

In [151]:
X_train.head()

,Pclass,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S,Sex_female,Sex_male,Age_Group_1,Age_Group_2,Age_Group_3
586,2,47.0,0,0,15.0000,0,0,1,0,1,0,1,0
267,3,25.0,1,0,7.7750,0,0,1,0,1,0,1,0
774,2,54.0,1,3,23.0000,0,0,1,1,0,0,1,0
112,3,22.0,0,0,8.0500,0,0,1,0,1,0,1,0
313,3,28.0,0,0,7.8958,0,0,1,0,1,0,1,0

In [152]:
X_test.head()

,Pclass,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S,Sex_female,Sex_male,Age_Group_1,Age_Group_2,Age_Group_3
119,3,2.000000,4,2,31.2750,0,0,1,1,0,1,0,0
881,3,33.000000,0,0,7.8958,0,0,1,0,1,0,1,0
301,3,22.274211,2,0,23.2500,0,1,0,0,1,0,0,0
77,3,27.255814,0,0,8.0500,0,0,1,0,1,0,0,0
275,1,63.000000,1,0,77.9583,0,0,1,1,0,0,1,0

In [153]:
X_test = df_test.drop("PassengerId", axis=1)

In [154]:
print(X_test)

     Pclass        Age  SibSp  Parch      Fare  Embarked_C  Embarked_Q  \
208       1  33.000000      0      0   27.7208           1           0
350       1  45.000000      0      1   63.3583           1           0
122       1  35.000000      1      0   57.7500           1           0
343       1  58.000000      0      1  512.3292           1           0
131       1  53.000000      0      0   28.5000           1           0
..      ...        ...    ...    ...       ...         ...         ...
165       3  26.000000      1      1   22.0250           0           0
163       3  24.525104      0      0    7.0000           0           0
161       3   7.000000      1      1   15.2458           1           0
199       3  23.073400      0      0    8.1125           0           0
417       3  24.525104      1      1   22.3583           1           0

     Embarked_S  Sex_female  Sex_male  Age_Group_1  Age_Group_2  Age_Group_3
208           0           1         0            0            1            0
350           0           1         0            0            1            0
122           0           1         0            0            1            0
343           0           1         0            0            1            0
131           0           0         1            0            1            0
..          ...         ...       ...          ...          ...          ...
165           1           1         0            0            1            0
163           1           0         1            0            0            0
161           0           0         1            1            0            0
199           1           1         0            0            0            0
417           0           0         1            0            0            0

[418 rows x 13 columns]

In [155]:
# Make predictions on the test set
y_pred_neigh = clf_neigh.predict(X_test)
#print(y_pred_neigh)

In [156]:
#Create a new column
df_test['Survived'] = y_pred_neigh

In [157]:
#select only column ID and Survived
result_test = df_test[['PassengerId', 'Survived']]

In [158]:
result_test

     PassengerId  Survived
208         1100         1
350         1242         1
122         1014         1
343         1235         1
131         1023         1
..           ...       ...
165         1057         0
163         1055         0
161         1053         1
199         1091         0
417         1309         0

[418 rows x 2 columns]

In [159]:
result_test.to_csv('result_test.csv', index=False)